Table of Contents
 Class SelectionItemForResults
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
SelectionItemForResults
[OpenModelClass("CI.StructModel.Loading.SelectionItemForResults,CI.Loading", "CI.StructModel.Loading.ISelectionItemForResults,CI.BasicTypes", typeof(SelectionItemForResults))]
public class SelectionItemForResults : OpenElementId
Inheritance
object
OpenObject
OpenElementId
SelectionItemForResults
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Coeff
Coefficient
public double Coeff { get; }
Property Value
double
 Description
Description
public string Description { get; }
Property Value
string
 Item
ILibraryItem
public ReferenceElement Item { get; set; }
Property Value
ReferenceElement
 TypeClassEvaluation
TypeClassEvaluation
public TypeClassEvaluation TypeClassEvaluation { get; set; }
Property Value
TypeClassEvaluation
 TypeOfLoad
TypeOfLoad
public string TypeOfLoad { get; }
Property Value
string
 Edit this page